Autodesk.Revit.DB.BackgroundImageFit
Indicates the background image fit type in rendering settings.
Since:
2013

Autodesk.Revit.DB.BackgroundImageFit.Stretch
The image is stretched in both directions so it matches the view's size.

Autodesk.Revit.DB.BackgroundImageFit.Horizontal
The image is proportionally resized so its width matches the view's width.

Autodesk.Revit.DB.BackgroundImageFit.Vertical
The image is proportionally resized so its height matches the view's height.

Autodesk.Revit.DB.BackgroundImageFit.None
No scale applied to the image; it will keep its original size.